---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.ArrowheadScale
source: html/32cf9117-3fb1-7162-6806-cca7de6417fd.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.ArrowheadScale Property

Type of arrow head scaling.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleVectorArrowheadScale ArrowheadScale { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration